{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calc/model_prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "out/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_3/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}}}, {"name": "layer_2/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}}}, {"name": "layer_1/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "layer_2/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_3/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "out/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "layer_1/MatMul", "op": "MatMul", "input": ["X", "layer_1/W"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "layer_1/add", "op": "AddV2", "input": ["layer_1/B", "layer_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/Relu", "op": "Relu", "input": ["layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/MatMul", "op": "MatMul", "input": ["layer_1/Relu", "layer_2/W"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/add", "op": "AddV2", "input": ["layer_2/B", "layer_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "Relu", "input": ["layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_3/MatMul", "op": "MatMul", "input": ["layer_2/Relu", "layer_3/W"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "layer_3/add", "op": "AddV2", "input": ["layer_3/B", "layer_3/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_3/Relu", "op": "Relu", "input": ["layer_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/MatMul", "op": "MatMul", "input": ["layer_3/Relu", "out/W"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "out/add", "op": "AddV2", "input": ["out/B", "out/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/Softmax", "op": "Softmax", "input": ["out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/model_prediction", "op": "ArgMax", "input": ["out/Softmax", "accuracy_calc/model_prediction/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "accuracy_calc/model_prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "out/W", "shape": [512, 10], "dtype": "float32"}, {"name": "layer_3/W", "shape": [1024, 512], "dtype": "float32"}, {"name": "layer_2/W", "shape": [512, 1024], "dtype": "float32"}, {"name": "layer_1/W", "shape": [1024, 512], "dtype": "float32"}, {"name": "layer_1/B", "shape": [512], "dtype": "float32"}, {"name": "layer_2/B", "shape": [1024], "dtype": "float32"}, {"name": "layer_3/B", "shape": [512], "dtype": "float32"}, {"name": "out/B", "shape": [10], "dtype": "float32"}]}]}